I was unable to reproduce the issue. It seems like our integration now works correctly, as long as the IDs for the records are different.

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # dnsimple_zone_record.test1 will be created
  + resource "dnsimple_zone_record" "test1" {
      + id             = (known after apply)
      + name           = "test"
      + priority       = (known after apply)
      + qualified_name = (known after apply)
      + ttl            = "60"
      + type           = "A"
      + value          = "1.2.3.5"
      + zone_id        = (known after apply)
      + zone_name      = "dns.solutions"
    }

  # dnsimple_zone_record.test2 will be created
  + resource "dnsimple_zone_record" "test2" {
      + id             = (known after apply)
      + name           = "test"
      + priority       = (known after apply)
      + qualified_name = (known after apply)
      + ttl            = "60"
      + type           = "A"
      + value          = "1.2.3.4"
      + zone_id        = (known after apply)
      + zone_name      = "dns.solutions"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```